MusicApp/app/views/bands/index.html.erb

<div>
    <% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"