MusicApp/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "alissa@gmail.com"], ["session_token", "ks_Pj0NtesUr7nNlQNbkjQ"], ["created_at", "2019-04-04 19:12:42.713808"], ["updated_at", "2019-04-04 19:12:42.713808"]]
---
    def create
        # why not do user_params?
        @user = User.new(user_params)

        if @user.save