MusicApp/app/views/albums/new.html.erb

SELECT "bands".* FROM "bands"
---
    <option disabled selected>-- Select a band --</option>
        <% Band.all.each do |band| %>