MusicApp/app/models/user.rb

    def password=(password)
        # @password = password # NEED?
        self.password_digest = BCrypt::Password.create(password)
        self.save! # NEED?
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"